import React from "react";
import style from './../css/login-reg.module.css';
import { Link } from "react-router-dom";

const Login_reg = () => {
    return (
        <div className={style.log_reg}>
        
            <div className={style.titel}>
                <h1 className="efreksium">EFREKSIUM</h1>
            </div>

            <div className={style.desc}>
                <span>Добро пожаловать в приложение для совместной оплаты счетов!</span>
            </div>
            
            <div className={style.buttons}>
                <div className={style.button_reg}>
                    <Link to="/sign_up">Зарегистрироваться</Link>
                </div>
                <div className={style.button_log}>
                    <Link to="/sign_in">Войти</Link>
                </div>
                <div className={style.button_log_vk}>
                    <Link to="/">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M0 11.5001C0 6.07894 0 3.36836 1.68413 1.68423C3.36827 9.15527e-05 6.07885 9.15527e-05 11.5 9.15527e-05H12.5C17.9212 9.15527e-05 20.6317 9.15527e-05 22.3158 1.68423C24 3.36836 24 6.07894 24 11.5001V12.5001C24 17.9212 24 20.6318 22.3158 22.3159C20.6317 24.0001 17.9212 24.0001 12.5 24.0001H11.5C6.07885 24.0001 3.36827 24.0001 1.68413 22.3159C0 20.6318 0 17.9212 0 12.5001L0 11.5001Z" fill="#2787F5"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M6.50045 7.50009H4.75005C4.24993 7.50009 4.1499 7.73549 4.1499 7.99499C4.1499 8.45854 4.74333 10.7575 6.913 13.798C8.35945 15.8745 10.3974 17.0001 12.2518 17.0001C13.3645 17.0001 13.5021 16.7501 13.5021 16.3195V14.7501C13.5021 14.2501 13.6075 14.1503 13.9598 14.1503C14.2195 14.1503 14.6645 14.2801 15.703 15.2812C16.8899 16.4678 17.0855 17.0001 17.7531 17.0001H19.5035C20.0036 17.0001 20.2536 16.7501 20.1094 16.2567C19.9515 15.765 19.3849 15.0516 18.633 14.2059C18.225 13.7239 17.6131 13.2048 17.4276 12.9452C17.168 12.6115 17.2422 12.4631 17.4276 12.1665C17.4276 12.1665 19.5602 9.16304 19.7827 8.14339C19.894 7.77254 19.7828 7.50009 19.2534 7.50009H17.503C17.058 7.50009 16.8527 7.73549 16.7414 7.99499C16.7414 7.99499 15.8514 10.1642 14.5904 11.5732C14.1824 11.9811 13.9969 12.1109 13.7744 12.1109C13.6631 12.1109 13.5021 11.9811 13.5021 11.6103V8.14339C13.5021 7.69839 13.3729 7.50009 13.002 7.50009H10.2513C9.9732 7.50009 9.8059 7.70659 9.8059 7.90234C9.8059 8.32414 10.4364 8.42144 10.5014 9.60799V12.1851C10.5014 12.7501 10.3993 12.8525 10.1768 12.8525C9.5834 12.8525 8.13995 10.6736 7.28385 8.18044C7.1161 7.69584 6.9478 7.50009 6.50045 7.50009V7.50009Z" fill="white"/>
                        </svg>{" "}
                        Войти через ВК
                    </Link>
                </div>
            </div>

            <div className={style.footer}>
                <span>Политика | Условия | Контакты</span>
            </div>
            
        </div>
    );
}

export default Login_reg;